# Intro python data science
## Práctica 05: pandas dataframe

Vamos a ver cómo:
* Punto 1: Crear dataframes
* Punto 2: Seleccionar elementos
* Punto 3: Ordenar columnas

# Punto 1:

In [1]:
# importar pandas
import pandas as pd

In [3]:
# datos de RRSS 2020
fbk = ['Facebook', 2449, True, 2006]
twt = ['Twitter', 339, False, 2006]
ig = ['Instagram', 1000, True, 2010]
yt = ['YouTube', 2000, False, 2005]
lkn = ['LinkedIn', 663, False, 2003]
wsp = ['WhatsApp', 1600, True, 2009]

In [5]:
lista_rrss = [fbk, twt, ig, yt, lkn, wsp]

In [7]:
# crear dataframe a partir de listas
columns = ['Name', 'People', 'Meta', 'Year']
df = pd.DataFrame(lista_rrss, columns=columns)
df

        Name  People   Meta  Year
0   Facebook    2449   True  2006
1    Twitter     339  False  2006
2  Instagram    1000   True  2010
3    YouTube    2000  False  2005
4   LinkedIn     663  False  2003
5   WhatsApp    1600   True  2009

In [9]:
# crear dataframe vacio
df_empty = pd.DataFrame(columns=columns)

In [11]:
df_empty

Empty DataFrame
Columns: [Name, People, Meta, Year]
Index: []

In [13]:
df_empty=df_empty._append({'Name': 'facebook', 'People': 2300, 'Meta': True, 'Year': 2020}, ignore_index=True)

In [15]:
df_empty

       Name People  Meta  Year
0  facebook   2300  True  2020

In [ ]:
# en proximos videos como crear dataframes a partir de csv o excel

# Punto 2:

In [ ]:
# seleccionar elementos: .loc vs .iloc

In [17]:
df

        Name  People   Meta  Year
0   Facebook    2449   True  2006
1    Twitter     339  False  2006
2  Instagram    1000   True  2010
3    YouTube    2000  False  2005
4   LinkedIn     663  False  2003
5   WhatsApp    1600   True  2009

In [19]:
# seleccionar un elemento por etiquetas
df.loc[1,'Name']

'Twitter'

In [21]:
# seleccionar un elemento por número
df.iloc[1,0]

'Twitter'

In [ ]:
# seleccionar por columnas/fila

In [23]:
df['Name']

0     Facebook
1      Twitter
2    Instagram
3      YouTube
4     LinkedIn
5     WhatsApp
Name: Name, dtype: object

In [25]:
df.iloc[2]

Name      Instagram
People         1000
Meta           True
Year           2010
Name: 2, dtype: object

In [ ]:
# seleccionar por condicion booleana

In [27]:
df['People']>1500

0     True
1    False
2    False
3     True
4    False
5     True
Name: People, dtype: bool

In [29]:
df[df['People']>1500]

       Name  People   Meta  Year
0  Facebook    2449   True  2006
3   YouTube    2000  False  2005
5  WhatsApp    1600   True  2009

# Punto 3:

In [ ]:
# Como ordenar columnas

In [41]:
# ordenar modo ascendente: de menor a mayor
df.sort_values('Name', ascending=True)

        Name  People   Meta  Year
3    YouTube    2000  False  2005
5   WhatsApp    1600   True  2009
1    Twitter     339  False  2006
4   LinkedIn     663  False  2003
2  Instagram    1000   True  2010
0   Facebook    2449   True  2006

In [45]:
# ordenar descendente: de mayor a menor
df.sort_values('People', ascending=False)

        Name  People   Meta  Year
0   Facebook    2449   True  2006
3    YouTube    2000  False  2005
5   WhatsApp    1600   True  2009
2  Instagram    1000   True  2010
4   LinkedIn     663  False  2003
1    Twitter     339  False  2006

In [ ]:
# ordenar por dos valores

In [49]:
# ordenar por dos columnas
df.sort_values(['Year','People'], ascending=[False,False])

        Name  People   Meta  Year
2  Instagram    1000   True  2010
5   WhatsApp    1600   True  2009
0   Facebook    2449   True  2006
1    Twitter     339  False  2006
3    YouTube    2000  False  2005
4   LinkedIn     663  False  2003

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

In [ ]:
palabra = 'Spiderman en el multiverso'
palabra[0:9]

'Spiderman'

In [ ]:
palabra[-10:len(palabra)]

'multiverso'

In [ ]:
palabra[-26:9]

'Spiderman'

In [ ]:
palabra = palabra + ' '
palabra *3

'Spiderman en el multiverso Spiderman en el multiverso Spiderman en el multiverso '

In [ ]:
palabra.title().strip()

'Spiderman En El Multiverso'

In [ ]:
txt = "welcome to the jungle"

x = txt.split()

print(x)

['welcome', 'to', 'the', 'jungle']

In [ ]:
hora = input('ingrese hora formato hh:mm:ss')
hora = hora.split(':')
msj = f'Son las {hora[0]}h:{hora[1]}min:{hora[2]}seg'
msj

ingrese hora formato hh:mm:ss18:24:55

'Son las 18h:24min:55seg'

In [ ]:
name = input('Ingrese su nombre')
print(name.title())

Ingrese su nombresamuel hurtado
Samuel Hurtado

In [ ]:
sexo = input('Ingrese sexo (f) femenino o (m) masculino: ')
edad = int(input('ingrese edad, solo numero: '))
cat = ''

if sexo.lower() == 'f':
  if edad < 23:
    cat = 'FA'
  else:
    cat = 'FB'
else:
  if edad < 25:
    cat = 'MA'
  else:
    cat = 'MB'
print(cat)

FB